biddr_api/biddr_api/app/views/auctions/index.html.erb

        <p class="card-text">
        Created By: <%= auction.user.first_name %> </p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]