biddr_api/biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        @auctions = Auction.order(created_at: :desc)

INSERT INTO "auctions" ("title", "body", "end_date", "reserve_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["body", "test"], ["end_date", nil], ["reserve_price", nil], ["user_id", nil], ["created_at", "2022-12-07 21:22:46.936644"], ["updated_at", "2022-12-07 21:22:46.936644"]]
---
    def create
        @auction = Auction.new(auction_params)
        @auction.user = current_user
        if @auction.is_valid?
            if @auction.save