biddr_api/biddr_api/app/controllers/bids_controller.rb

    def create
        @bid = Bid.new(bid_params)
        @bid.auction = @auction
        @bid.user = current_user
        if @bid.save
---
INSERT INTO "bids" ("ammount", "auction_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ammount", 50.0], ["auction_id", 1], ["user_id", 1], ["created_at", "2022-12-07 21:48:59.434939"], ["updated_at", "2022-12-07 21:48:59.434939"]]

    def find_auction
        @auction = Auction.find params[:auction_id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]